
#### Terraform Format 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.mine_server_rg: Reading...
data.azurerm_resource_group.mine_server_rg: Read complete after 0s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg]
data.azurerm_storage_account.mine_server_storage: Reading...
data.azurerm_storage_account.mine_server_storage: Read complete after 1s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Storage/storageAccounts/mineserversa]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_group.mine_server will be created
  + resource "azurerm_container_group" "mine_server" {
      + dns_name_label              = "folly-mine-server"
      + dns_name_label_reuse_policy = "Noreuse"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "brazilsouth"
      + name                        = "mine-server"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "mine-server-rg"
      + restart_policy              = "Always"
      + sku                         = "Standard"

      + container {
          + commands = (known after apply)
          + cpu      = 4
          + image    = "itzg/minecraft-server:latest"
          + memory   = 8
          + name     = "mine-container"

          + ports {
              + port     = 25565
              + protocol = "TCP"
            }
          + ports {
              + port     = 443
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/data"
              + name                 = "mine-volume"
              + read_only            = false
              + share_name           = "mineserverfileshare"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mineserversa"
            }
        }
    }

  # azurerm_storage_share.mine_file_share will be created
  + resource "azurerm_storage_share" "mine_file_share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "mineserverfileshare"
      + quota                = 5
      + resource_manager_id  = (known after apply)
      + storage_account_name = "mineserversa"
      + url                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mfollypp, Action: `pull_request`, Workflow: `Terraform`*